zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/middleware/wireless/framework_5.3.2/XCVR/MKW41Z4/fsl_xcvr.h
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef _FSL_XCVR_H_
/* clang-format off */
#define _FSL_XCVR_H_
/* clang-format on */

#include "fsl_device_registers.h"
#include "fsl_xcvr_trim.h"

#if gMWS_UseCoexistence_d
#include "MWS.h"
#endif /* gMWS_UseCoexistence_d */
/*!
 * @addtogroup xcvr
 * @{
 */

/*! @file*/

/*******************************************************************************
 * Definitions
 ******************************************************************************/
 /* Default RF OSC definition. Allows for compile time clock frequency definition */
#ifdef CLOCK_MAIN

#else
#if RF_OSC_26MHZ == 1
#define CLOCK_MAIN (EXT_CLK_26_MHZ) /* See ext_clock_config_t for this value */
#else
#define CLOCK_MAIN (EXT_CLK_32_MHZ) /* See ext_clock_config_t for this value */
#endif
#endif
 
#define AUX_PLL_DELAY               (0)
#define FSL_XCVR_DRIVER_VERSION (MAKE_VERSION(0, 0, 1))

#define USE_DEFAULT_PRE_REF             (0)
#define TRIM_BBA_DCOC_DAC_AT_INIT       (1)
#define PRESLOW_ENA                     (1)

/* TSM bitfield shift and value definitions */
#define TX_DIG_EN_ASSERT    (95)
#define ZGBE_TX_DIG_EN_ASSERT (TX_DIG_EN_ASSERT-1) /* Zigbee TX_DIG_EN must assert 1 tick sooner, see adjustment below based on data padding */
#define B0(x)   (((uint32_t)(((uint32_t)(x)) << 0)) & 0xFFU)
#define B1(x)   (((uint32_t)(((uint32_t)(x)) << 8)) & 0xFF00U)
#define B2(x)   (((uint32_t)(((uint32_t)(x)) << 16)) & 0xFF0000U)
#define B3(x)   (((uint32_t)(((uint32_t)(x)) << 24)) & 0xFF000000U)
/* EDIT THIS LINE TO CONTROL PA_RAMP! */
#define PA_RAMP_TIME    (2) /* only allowable values are 0, 2, 4, or 8 for PA RAMP times */

#if !((PA_RAMP_TIME==0) || (PA_RAMP_TIME==2) || (PA_RAMP_TIME==4) || (PA_RAMP_TIME==8))
#error "Invalid value for PA_RAMP_TIME macro"
#endif /* Error check of PA RAMP TIME */
#define ADD_FOR_26MHZ   (4)
#define END_OF_TX_WU_NORAMP     (103) /* NOTE: NORAMP and 2us ramp time behaviors are identical for TX WU and WD */
#define END_OF_TX_WD_NORAMP     (111) /* NOTE: NORAMP and 2us ramp time behaviors are identical for TX WU and WD */
/* Redefine the values of END_OF_TX_WU and END_OF_TX_WD based on whether DATA PADDING is enabled and the selection of ramp time */
/* These two constants are then used on both common configuration and mode specific configuration files to define the TSM timing values */
#if ((PA_RAMP_TIME==0) || (PA_RAMP_TIME==2))
   #define END_OF_TX_WU   (END_OF_TX_WU_NORAMP)
   #define END_OF_TX_WD   (END_OF_TX_WD_NORAMP)
   #define TX_SYNTH_DELAY_ADJ (0)
   #define PD_CYCLE_SLIP_TX_HI_ADJ (0)
   #define PD_CYCLE_SLIP_TX_LO_ADJ (1)
   #define ZGBE_TX_DIG_EN_TX_HI_ADJ (-5) /* Only applies to Zigbee mode */
   #if (PA_RAMP_TIME==0)
      #define PA_RAMP_SEL 0
      #define DATA_PADDING_EN (0)
      #define TX_DIG_EN_TX_HI_ADJ (-2)
   #else
      #define PA_RAMP_SEL 1
      #define DATA_PADDING_EN (1)
      #define TX_DIG_EN_TX_HI_ADJ (0)
   #endif
#else /* ((PA_RAMP_TIME==0) || (PA_RAMP_TIME==2)) */
  #if (PA_RAMP_TIME==4)
    #define END_OF_TX_WU    (END_OF_TX_WU_NORAMP+2)
    #define END_OF_TX_WD    (END_OF_TX_WD_NORAMP+4)
    #define TX_SYNTH_DELAY_ADJ (2)
    #define PD_CYCLE_SLIP_TX_HI_ADJ (2)
    #define PD_CYCLE_SLIP_TX_LO_ADJ (1)
    #define TX_DIG_EN_TX_HI_ADJ (0)
    #define ZGBE_TX_DIG_EN_TX_HI_ADJ (-3) /* Only applies to Zigbee mode */
    #define PA_RAMP_SEL 2
    #define DATA_PADDING_EN (1)
  #else /* (PA_RAMP_TIME==4) */
    #if (PA_RAMP_TIME==8)
      #define END_OF_TX_WU    (END_OF_TX_WU_NORAMP+6)
      #define END_OF_TX_WD    (END_OF_TX_WD_NORAMP+12)
      #define TX_SYNTH_DELAY_ADJ (6)
      #define PD_CYCLE_SLIP_TX_HI_ADJ (6)
      #define PD_CYCLE_SLIP_TX_LO_ADJ (1)
      #define TX_DIG_EN_TX_HI_ADJ (4)
      #define ZGBE_TX_DIG_EN_TX_HI_ADJ (1) /* Only applies to Zigbee mode */
      #define PA_RAMP_SEL 3
      #define DATA_PADDING_EN (1)
    #else /* (PA_RAMP_TIME==8) */
      #error "Invalid value for PA_RAMP_TIME macro"
    #endif /* (PA_RAMP_TIME==8) */
  #endif/* (PA_RAMP_TIME==4) */
#endif /* ((PA_RAMP_TIME==0) || (PA_RAMP_TIME==2)) */
#define TX_DIG_EN_ASSERT_MSK500    (END_OF_TX_WU-3)

#define END_OF_RX_WU    (104+AUX_PLL_DELAY)
#if RF_OSC_26MHZ == 1
#define END_OF_RX_WD    (END_OF_RX_WU+1+ADD_FOR_26MHZ)  /* Need to handle normal signals extending when 26MHZ warmdown is extended */
#else
#define END_OF_RX_WD    (END_OF_RX_WU+1)
#endif
#define END_OF_RX_WU_26MHZ  (END_OF_RX_WU+ADD_FOR_26MHZ)
#define END_OF_RX_WD_26MHZ  (END_OF_RX_WU+1+ADD_FOR_26MHZ)

